

# ---------------------------------------------------
# パラメータ管理
# ---------------------------------------------------
class Param
  
  
  # -----------------------------------------------
  # コンストラクタ
  # -----------------------------------------------
  constructor: ->
    
    @_gui;
    @appName = "MASS";
    
    @zKeisu = 200;
    @alpha = 40;
    @rx = 15;
    @ry = 15;
    @rz = 50;
    
    @camZ = 8;
    
    
    @_init();
  
  
  
  # -----------------------------------------------
  # 初期化
  # -----------------------------------------------
  _init:  =>
    
    if MY.conf.FLG.PARAM
    
      @_gui = new dat.GUI();
      #@_gui.add(@, 'appName');
      
#       @_gui.add(@, 'zKeisu', 0, 400).step(1);
      #@_gui.add(@, 'alpha', 0, 100).step(1);
      #@_gui.add(@, 'rx', 0, 200).step(1);
      #@_gui.add(@, 'ry', 0, 200).step(1);
      #@_gui.add(@, 'rz', 0, 200).step(1);
      #@_gui.add(@, 'camZ', 0, 20).step(1);
      
      $(".dg").css({
        zIndex:99999
      });






module.exports = Param;