Display           = require('../libs/display/Display');
MyDisplay         = require('./MyDisplay');
ResponsiveDisplay = require('../parts/ResponsiveDisplay');


# ---------------------------------------------------
# 基本ボタンクラス
# ---------------------------------------------------
class MyBtn extends MyDisplay
  
  
  # -----------------------------------------------
  # コンストラクタ
  # -----------------------------------------------
  constructor: (option) ->
    
    super(option);
    
    # ボタン領域
    @_btn;
    
    # コールバック ロールオーバー
    @onRollOver;
    
    # コールバック ロールアウト
    @onRollOut;
    
    # コールバック クリック
    @onClick;
  
  
  
  # -----------------------------------------------
  # 初期化
  # -----------------------------------------------
  init: =>
    
    super();
  
  
  
  # -----------------------------------------------
  # ボタン領域作成
  # -----------------------------------------------
  makeBtn: =>
    
    @_makeBtn();
  
  
  
  # -----------------------------------------------
  # ボタン領域作成
  # -----------------------------------------------
  _makeBtn: =>
    
    # ボタン領域
    @_btn = new Display();
    @_btn.init();
    @add(@_btn);
    @_btn.opacity(0);
    @_btn.bgColor("#FF0000");
    
    if MY.u.isSmt()
      @_btn.elm().on("touchend").on("click", @_eClick);
    else
      @_btn.elm().on("mouseover", @_eRollOver).on("mouseout", @_eRollOut).on("click", @_eClick);
  
  
  
  # -----------------------------------------------
  # 破棄
  # -----------------------------------------------
  dispose: =>
    
    if @_btn?
      @_btn.dispose();
      @_btn = null;
    
    @onRollOver = null;
    @onRollOut  = null;
    @onClick    = null;
    
    super();
  
  
  
  # -----------------------------------------------
  # イベント ロールオーバー
  # -----------------------------------------------
  _eRollOver: (e) =>
    
    MY.u.buttonMode(true);
    
    if @onRollOver?
      @onRollOver();
  
  
  
  # -----------------------------------------------
  # イベント ロールアウト
  # -----------------------------------------------
  _eRollOut: (e) =>
    
    MY.u.buttonMode(false);
    
    if @onRollOut?
      @onRollOut();
  
  
  
  # -----------------------------------------------
  # イベント クリック
  # -----------------------------------------------
  _eClick: (e) =>
    
    MY.u.buttonMode(false);
    
    if @onClick?
      @onClick();
  
  
  
  # -----------------------------------------------
  # ボタン領域のサイズ設定
  # -----------------------------------------------
  setBtnSize: (w, h) =>
    
    if @_btn?
      @_btn.size(w, h);
      @_btn.render();
      @size(w, h);
      @render();
  
  
  
  # -----------------------------------------------
  # 更新
  # -----------------------------------------------
  _update: =>
    
    super();
  
  
  
  # -----------------------------------------------
  # リサイズ
  # -----------------------------------------------
  _resize: (w, h) =>
    
    super(w, h);










module.exports = MyBtn;